PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_nnlite.h
/***************************************************************************//**
* \file cy_nnlite.h
* \version 1.0
*
* \brief
* Provides NNLite accelerator pdl API declarations.
*
********************************************************************************
* \copyright
* Copyright 2016-2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
*
* \section group_nnlite_changelog Changelog
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>

*******************************************************************************/

/*****************************************************************************/
/* Include files                                                             */
/*****************************************************************************/
#ifndef CY_NNLITE_PDL_H
#define CY_NNLITE_PDL_H

#include "cy_device.h"
#if defined (CY_IP_MXNNLITE)

/**
* \defgroup group_nnlite             NNLITE HW Accelerator (NNLITE)
* \{
* This driver provides NNLite accelerator pdl defines and API function definitions.
*
* \defgroup group_nnlite_macros Macro
* \defgroup group_nnlite_functions Functions
* \defgroup group_nnlite_data_structures Data structures
* \defgroup group_nnlite_enums Enumerated types
*/

#if defined(__cplusplus)
extern "C" {
#endif
#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#include "cy_syslib.h"


/** \addtogroup group_nnlite_macros
* \{
*/

/*****************************************************************************/
/* Global pre-processor symbols/macros ('#define')                           */
/*****************************************************************************/

/** NNLite driver ID */
#define CY_NNLITE_ID                              CY_PDL_DRV_ID(0x48U)

#if CY_IP_MXNNLITE_VERSION==1
/** NNLite type */
#define NNLITE_Type                               MXNNLITE_1_0_Type
#elif CY_IP_MXNNLITE_VERSION==2

/** NNLite type */
#define NNLITE_Type                               MXNNLITE_2_0_Type
#else
#error CY_IP_MXNNLITE_VERSION macro unset/unrecognized setting
#endif



/** Output Scaling 1 mask */
#define NNLITE_NO_SCALING                         (0x3F800000U)

#if CY_IP_MXNNLITE_VERSION==1

/** Output value Clipping mask */
#define NNLITE_BYTE_CLIPING                       (0xFFU)


/** Error Interrupt */
#define NNLITE_INTR_ERRORS_MASK                 (MXNNLITE_1_0_INTR_MASKED_INTR_MASKED_MEM_ERR_SPARSITY_Msk | \
                                                 MXNNLITE_1_0_INTR_MASKED_INTR_MASKED_MEM_ERR_ACTIVATIONSTREAMER_Msk | \
                                                 MXNNLITE_1_0_INTR_MASKED_INTR_MASKED_MEM_ERR_WEIGHTSTREAMER_Msk | \
                                                 MXNNLITE_1_0_INTR_MASKED_INTR_MASKED_MEM_ERR_BIASSTREAMER_Msk | \
                                                 MXNNLITE_1_0_INTR_MASKED_INTR_MASKED_MEM_ERR_OUTPUTSTREAMER_Msk)

/** Interrupt Enable mask */
#define NNLITE_INTR_ENABLE_MASK                 (MXNNLITE_1_0_INTR_MASKED_INTR_MASKED_DONE_Msk | \
                                                 MXNNLITE_1_0_INTR_MASKED_INTR_MASKED_SATURATION_Msk | \
                                                 NNLITE_INTR_ERRORS_MASK)
#else
/** Read Error Interrupt */
#define NNLITE_INTR_READ_ERRORS_MASK           (MXNNLITE_2_0_INTR_MASKED_INTR_MASKED_MEM_ERR_SPARSITY_Msk | \
                                                 MXNNLITE_2_0_INTR_MASKED_INTR_MASKED_MEM_ERR_ACTIVATIONSTREAMER_Msk | \
                                                 MXNNLITE_2_0_INTR_MASKED_INTR_MASKED_MEM_ERR_WEIGHTSTREAMER_Msk | \
                                                 MXNNLITE_2_0_INTR_MASKED_INTR_MASKED_MEM_ERR_BIASSTREAMER_Msk)
/** Write Error Interrupt */
#define NNLITE_INTR_WRITE_ERRORS_MASK           (MXNNLITE_2_0_INTR_MASKED_INTR_MASKED_MEM_ERR_OUTPUTSTREAMER_Msk)
/** Error Interrupt */
#define NNLITE_INTR_ERRORS_MASK               (NNLITE_INTR_WRITE_ERRORS_MASK|NNLITE_INTR_READ_ERRORS_MASK)
/** Saturation Interrupt */
#define NNLITE_SATURATION_MASK                (MXNNLITE_2_0_INTR_INTR_ACCUMULATION_SATURATION_Msk| \
                                               MXNNLITE_2_0_INTR_INTR_INPUT_PRESCALE_SATURATION_Msk| \
                                               MXNNLITE_2_0_INTR_INTR_OUTPUT_PRESCALE_SATURATION_Msk| \
                                               MXNNLITE_2_0_INTR_INTR_OUTPUT_POSTSCALE_SATURATION_Msk \
                                               )


/**
 *
 * @brief Interrupt Enable mask
 *
 * Memory error interrupts active and hence detected as error states. Saturation ignored (but accessible
 * via context structure)
 *
 *
 * Note: Needs some API to non-default interrupt/event masking.
 *
*/
#define NNLITE_INTR_ENABLE_MASK    (MXNNLITE_2_0_INTR_MASKED_INTR_MASKED_DONE_Msk | NNLITE_INTR_ERRORS_MASK)
/** Fractional bits produced by tanh  interpolation */
#define NNLITE_TANH_FRAC_BITS 24u
/** Fractional bits produced by sigmoid interpolation */
#define NNLITE_SIGM_FRAC_BITS 25u
/** Fractional bits produced by 2^-x interpolation */
#define NNLITE_RECIP_POW2_FRAC_BITS 24
/** Preshift of add/sub inputs when prescaling */
#define NNLITE_ADDSUB_PRESCALE_SHIFT_BITS 8

#endif

/** \} group_nnlite_macros */


/** \addtogroup group_nnlite_enums
* \{
*/
#if CY_IP_MXNNLITE_VERSION==1

/** NNLite pdl status codes */
typedef enum
{
    CY_NNLITE_SUCCESS = 0U, /**< Status successful  */

    CY_NNLITE_OP_QUEUED = 1U, /** Operation is Pending state */

