PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_nnlite.h
    CY_NNLITE_MEM_ERR_SPARSITY = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR |
                                  MXNNLITE_1_0_INTR_INTR_MEM_ERR_SPARSITY_Msk), /**< Mem fetch Error for Sparsity */

    CY_NNLITE_MEM_ERR_ACTIVATION_STREAMER = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR |
                                            MXNNLITE_1_0_INTR_INTR_MEM_ERR_ACTIVATIONSTREAMER_Msk),  /**< Mem fetch Error for Activation pointer */

    CY_NNLITE_MEM_ERR_WEIGHT_STREAMER = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR |
                                         MXNNLITE_1_0_INTR_INTR_MEM_ERR_WEIGHTSTREAMER_Msk), /**< Mem fetch Error for Weight pointer */

    CY_NNLITE_MEM_ERR_BIAS_STREAMER = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR |
                                       MXNNLITE_1_0_INTR_INTR_MEM_ERR_BIASSTREAMER_Msk), /**< Mem fetch Error for Bias pointer */

    CY_NNLITE_MEM_ERR_OUTPUT_STREAMER = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR |
                                         MXNNLITE_1_0_INTR_INTR_MEM_ERR_OUTPUTSTREAMER_Msk),/**< Mem Error for Output pointer */

    CY_NNLITE_SATURATION = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR |
                            MXNNLITE_1_0_INTR_INTR_SATURATION_Msk), /**< Saturation in output */

    CY_NNLITE_BAD_PARAM = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x41U),  /**< function call with invalid parameter*/

    CY_NNLITE_BAD_STATE = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x42U), /**< Invalid state, order */

    CY_NNLITE_EXTERN_API_ERR = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x43U), /**< Error code for system (RTOS) level API failure */

} cy_en_nnlite_status_t;

#else

/** NNLite pdl status codes */
typedef enum
{
    CY_NNLITE_SUCCESS = 0U, /**< Status successful  */

    CY_NNLITE_OP_QUEUED = 1U, /** Operation is Pending state */

    /**
     * @brief Mem read Error
     * Bus error response for a value read.  I.e. and invalid address for
     * for a nn-zero weight count, sparsity map, bias, scale-factor,
     * weights or activation fetch
    */
    CY_NNLITE_MEM_READ_ERR  = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x11),

    /**
     * @brief Mem write error
     * Bus error response for a value write - output is only writer at present
     *
     */
    CY_NNLITE_MEM_WRITE_ERR = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x12),

    /**
     * @brief Arithmetic saturation events.
     *
     * Arithmetic saturation was detected during processing of the operation.
     * @note Saturation does not halt operation process - this continues to completion or an
     * error event.
     * @note Currently saturation event interrupts are masked and hence ignored by the PDL.  However
     * their presence can be detected in the @c cy_nnlite_context_t structure @c opIntrStatus
     * structure.
     *
     */
    CY_NNLITE_SATURATION_EVENT = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x13),

    CY_NNLITE_BAD_PARAM = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x41U),  /**< function call with invalid parameter*/

    CY_NNLITE_BAD_STATE = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x42U), /**< Invalid state, order */

    CY_NNLITE_EXTERN_API_ERR = (CY_NNLITE_ID | CY_PDL_STATUS_ERROR | 0x43U), /**< Error code for system (RTOS) level API failure */
} cy_en_nnlite_status_t;

#endif


#if CY_IP_MXNNLITE_VERSION==1

/** NNLite nn layer type*/
typedef enum
{
    CY_NNLITE_FC_LAYER = 0U, /**< NN FC or Dense Layer */
    CY_NNLITE_CONV_LAYER = 1U, /**< NN Convolution Layer */
    CY_NNLITE_LAST_LAYER_CODE = 1u
} cy_en_nnlite_layer_t;


/** Out Activation type, includes some implement via PDL */
typedef enum
{
    CY_NNLITE_ACTIVATION_NONE = 0U, /**< Activation type none */
    CY_NNLITE_ACTIVATION_RELU = 1U, /**< Activation type RELU */
    CY_NNLITE_ACTIVATION_LEAKY_RELU = 2U, /**< Activation type leaky RELU */
} cy_en_nnlite_fused_activation_t;
#else
/** Out Activation type, includes some implement via PDL
*   @note For ReLU use clipping mask with ACTIVATION_NONE
*   For Leaky ReLU use ACTIVATION_PWL together with interpolation params
*/
typedef enum
{
    CY_NNLITE_ACTIVATION_NONE = 0U,         /**< No function applied    - Only re-scaling */
    CY_NNLITE_ACTIVATION_SIGMOID = 1U,      /**< Sigmoid: sigma(2x)    - Q1.25 result from Q8.16 / Q8.8 input */
    CY_NNLITE_ACTIVATION_TANH = 2U,         /**< Tanh: tanh(x)          - Q1.24 from Q8.8 / Q16.8 input */
    CY_NNLITE_ACTIVATION_PWL = 3U,          /**< No function applied    - Output re-scaling left / right 0 differently (used for leaky RELU) */
    CY_NNLITE_ACTIVATION_RECIP_POW2 = 4U,   /**< 2^-x                   - positive Q31 from  non-negative Q3.8 / Q3.16 input (saturating) */
    CY_NNLITE_ACTIVATION_RECIPROCAL = 5U,   /**< 1/x                    - 32-bit IEEE754 float from positive Qx.31 input */

} cy_en_nnlite_fused_activation_t;
#endif

/** Activation size */
typedef enum
{
    CY_NNLITE_ACTIVATION_8BIT = 0U, /**< 8 bits Activation  */
    CY_NNLITE_ACTIVATION_16BIT = 1U, /**< 16 bits Activation */
} cy_en_nnlite_activation_size_t;

/** Output size */
typedef enum
{
    CY_NNLITE_OUTPUT_8BIT = 0U, /**< 8 bit Output words */
    CY_NNLITE_OUTPUT_16BIT = 1U, /**< 16 bits Output words */
    CY_NNLITE_OUTPUT_32BIT = 2U /**< 32 bits Output words */
} cy_en_nnlite_output_size_t;


/** Input re-scaling mode */
typedef enum
{
    CY_NNLITE_RESCALE_NONE = 0U, /**< No re-scaling */
    CY_NNLITE_RESCALE_WGT = 1U,  /**< Rescale Weights */
    CY_NNLITE_RESCALE_ACT = 2U   /**< Rescale Activations */
} cy_en_nnlite_input_rescaling_t;

/** Output re-scaling mode */
typedef enum
{

    CY_NNLITE_OUTSCALE_NONE = 0U,        /**< No re-scaling (hard-wired 1.0 scale factor) */
    CY_NNLITE_OUTSCALE_PER_TENSOR = 1U,  /**< Per-tensor re-scaling      */
    CY_NNLITE_OUTSCALE_PER_AXIS = 2,     /**< Per-filter re-scaling       */
    CY_NNLITE_OUTSCALE_PER_ROW = 3,     /**< Per output row re-scaling   */
} cy_en_nnlite_output_rescaling_t;


/** NNLite nn operation type*/
typedef enum
{
    CY_NNLITE_NOOP_ACT = 0U, /**< Pass-through act stream (inputs left shifted 16) */
    CY_NNLITE_MUL = 1U, /**< NN Convolution Layer, pointwise mul */
    CY_NNLITE_ADD = 2U, /**< NN Pointwise addition (inputs left shifted 16) */
    CY_NNLITE_SUB_LR = 3U, /**< NN Pointwise subtraction activation/rhs - weights/lhs (inputs left shifted 16) */
    CY_NNLITE_SUB_RL = 4U, /**< NN Pointwise subtraction weights/lhs - activation/rhs (left shifted 16) */
    CY_NNLITE_SUM_ACT = 5U, /** NN Summation act stream */
    CY_NNLITE_MIN_ACT = 6U, /** Max of act stream */
    CY_NNLITE_MAX_ACT = 7U, /** Max of act stream */
    CY_NNLITE_SUM_ACT32 = 8U /** NN Summation act stream, shift inputs to treat as single 32-bit value*/
} cy_en_nnlite_op_t;


/** NNLite nn operating mode type*/
typedef enum
{
    CY_NNLITE_DWACT_WGT = 0U,   /**< "Depthwise"-striped channel activation + weights */
    CY_NNLITE_ACT_WGT = 1U,     /**< Channel-minor activation + weights */
    CY_NNLITE_DWACT_ONLY = 2U,  /**< "Depthwise"-striped channel activation only */
    CY_NNLITE_ACT_ONLY = 3U,  /**<  Channel-minor activation only */
} cy_en_nnlite_mode_t;

/** NNLite length of weight prefetch */
typedef enum
{
    CY_NNLITE_PREFETCH_WORD_1x128  = 0U,  /**< prefetch 1x128 weights */
    CY_NNLITE_PREFETCH_WORD_2x128  = 1U,  /**< prefetch 2x128 weights */
    CY_NNLITE_PREFETCH_WORD_3x128  = 2U,  /**< prefetch 3x128 weights */
    CY_NNLITE_PREFETCH_WORD_4x128  = 3U,  /**< prefetch 4x128 weights, default value */
} cy_en_nnlite_prefetch_length_t;


/** Streamer id's */
typedef enum
{
    CY_NNLITE_ACTIVATION_STREAMER = 0U, /**< Activation Streamer ID */
    CY_NNLITE_WEIGHT_STREAMER = 1U, /**< Weight Streamer ID */
    CY_NNLITE_BIAS_STREAMER = 2U, /**< Bias Streamer ID */
    CY_NNLITE_OUT_STREAMER = 3U, /**< Output Streamer ID */
#if CY_IP_MXNNLITE_VERSION==2
    CY_NNLITE_SCALE_STREAMER = 4U,  /**< Scale-factors (per-axis/per-row) */
    CY_NNLITE_WEIGHT_COUNT_STREAMER = 5U, /**<  Non-zero weight count for sparse weights */
    CY_NNLITE_SPARSITY_MAP_STREAMER = 6U, /**<  Sparsity map for sparse weights */
#endif
} cy_en_nnlite_streamer_id_t;

/** NNLite PDL Driver State Machine*/
typedef enum
{
    CY_NNLITE_DEINIT = 0U, /**< Deinitialized State */
    CY_NNLITE_INIT = 1U, /**< Init State */
    CY_NNLITE_CONFIG_STATE = 2U, /**< Configuration State */
    CY_NNLITE_OP_STARTED = 3U, /**< NN layer Operation Started */
    CY_NNLITE_OP_DONE = 4U, /**< Last NN operation completed */
} cy_en_nnlite_state_t;

/** \} group_nnlite_enums */

/**
* \addtogroup group_nnlite_data_structures
* \{
*/

/**
 *****************************************************************************
 ** \brief nnlite context structure
 *****************************************************************************/
typedef struct cy_nnlite_context
{
    volatile cy_en_nnlite_state_t nnliteState; /**< Current state of nnlite driver */
    volatile cy_en_nnlite_status_t opStatus; /**< Status of last operation */
    volatile uint32_t opIntrStatus; /**< Raw nnlite interrupt status of last operation */
} cy_nnlite_context_t;

/**
 *****************************************************************************
 ** \brief nnlite sparsity configuration
 *****************************************************************************/
typedef struct cy_nnlite_sparsity_cfg
{
    uintptr_t nonZeroWtAddr; /**< non zero weight address */
    uintptr_t sparsityBitMapAddr; /**< sparsity bit map address */
    uintptr_t wtAddr; /**< weight address */
} cy_nnlite_sparsity_cfg_t;


