PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_nnlite.h
#if CY_IP_MXNNLITE_VERSION==1

/**
 *****************************************************************************
 ** \brief nnlite 1.0 clipping settings (simple bitmask)
 *****************************************************************************/
typedef uint32_t cy_nnlite_clipping_t;

#else
/**
 *****************************************************************************
 ** \brief nnlite 2.0 and later clipping settings signed min/max values
 *****************************************************************************/
typedef struct cy_nnlite_clipping_s
{
    int16_t min; /**< minimum value (signed) to clip in out streamer*/
    int16_t max; /**< maximum value (signed) to clip in out streamer */
} cy_nnlite_clipping_t;

#endif

/** \} group_nnlite_data_structures */

/*******************************************************************************
*                           Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_nnlite_functions
* \{
*/

/*****************************************************************************/
/* Global function prototypes ('extern', definition in C source)             */
/*****************************************************************************/

/**
 *****************************************************************************
 ** \brief  nnlite driver init function, validate context structure and
 ** set driver to init state
 **
 ** \param [in]  nnlite     base pointer of NNLite Register  Map.
 **
 ** \param [in]  context    pointer to the driver context structure.
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Init(NNLITE_Type *nnlite, cy_nnlite_context_t *context);

/**
 *****************************************************************************
 ** \brief  nnlite driver deinit function check's for pending or ongoing
 ** operation and set driver state to deinit
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure.
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_DeInit(NNLITE_Type *nnlite,
                                       cy_nnlite_context_t *context);

/**
 *****************************************************************************
 ** \brief nnlite start operation, streamer should should be configured before
 ** calling this function, this function will write to start bit in CMD MEMIO
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure.
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_Start(NNLITE_Type *nnlite,
                                      cy_nnlite_context_t *context);

/**
 *****************************************************************************
 ** \brief  nnlite stop/abort operation, can be used to stop/abort current
 ** operation or to reset all configuration, API write abort in CMD MEMIO
 ** which will reset all the registers
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure.
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_Stop(NNLITE_Type *nnlite,
                                     cy_nnlite_context_t *context);

#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 **  Compute size of sparsity map in bytes for given number of number of weights.
 **
 **
 **  \param [in]  num_weights    Number of weights.
 ** \retval Size in bytes.
 *****************************************************************************/
static inline uint32_t Cy_NNLite_SparsityMapSize(uint32_t num_weights)
{
    /* Start is byte aligned */
    return (num_weights + 7u) / 8u;
}


/**
 *****************************************************************************
 **  parse sparsity map, API will  parse sparsity bit map and update non
 **  zero weight pointer, sparsity bit map address and weight pointer in
 **  sparCfg, sparsity configuration structure
 **
 **  \param [in]  sparsitybaseAddr sparsity map base address
 **
 **  \param [in]  sparseBitMapLen  Size of sparsity bitmap in bytes
 **
 **  \param [in]  activationRepeats  activation streamer repeat count
 **
 **  \param [out]  sparCfg sparsity configuration
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_ParseSparsity(NNLITE_Type *nnlite, const void *sparsitybaseAddr,
                        uint32_t activationRepeats, uint32_t sparseBitMapLen, cy_nnlite_sparsity_cfg_t *sparCfg);

/**
 *****************************************************************************
 **  configure sparsity from valid cy_nnlite_sparsity_cfg
 **  write non zero wt pointer and sparsity bit map MEMIO and enable sparsity
 **  in streamer mode MEMIO
 **
 ** \param [in]  nnlite base pointer of register map.
 **
 ** \param [out]  sparCfg sparsity configuration
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SparsityCfg(NNLITE_Type *nnlite, cy_nnlite_sparsity_cfg_t *sparCfg);


/**
 *****************************************************************************
 ** \brief nnlite enable sparsity in streamer mode MEMIO
 **
 ** \param [in]  nnlite base pointer of register map.
 **
 ** \param [in]  sparsityEn sparsity enable
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SparsityEnable(NNLITE_Type *nnlite, bool sparsityEn);

/**
 *****************************************************************************
 ** \brief  nnlite activation streamer configuration set, API will configure
 ** parameters for activation streamer
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure
 **
 ** \param [in]  filterWidth  filter width
 **
 ** \param [in]  filterHeight  fFilter height
 **
 ** \param [in]  activationRepeats  activation streamer repeat count (how often each "kernel footprint" needs to be fetched)
 **
 ** \param [in]  inputWidth  input activation Width
 **
 ** \param [in]  inputHeight  input activation Height
 **
 ** \param [in]  inputChannel  input activation channels
 **
 ** \param [in]  inputChannel  channel depth multiplier (depthwise convolution only)
 **
 ** \param [in]  startCol  starting column for activation
 **
 ** \param [in]  startRow  starting row for activation
 **
 ** \param [in]  padVal  padding value
 **
 ** \param [in]  padHeight  padding Height
 **
 ** \param [in]  padWidth  padding Width
 **
 ** \param [in]  strideCol  Stride column
 **
 ** \param [in]  strideRow  Stride rows
 **
 ** \param [in]  inputOffset input offset value
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
#endif

/**
 *****************************************************************************
 ** \brief  nnlite activation streamer configuration set, API will configure
 ** parameters for activation streamer
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure
 **
 ** \param [in]  filterWidth  filter width
 **
 ** \param [in]  filterHeight  fFilter height
 **
 ** \param [in]  activationRepeats  activation streamer repeat count (how often each "kernel footprint" needs to be fetched)
 **
 ** \param [in]  inputWidth  input activation Width
 **
 ** \param [in]  inputHeight  input activation Height
 **
 ** \param [in]  inputChannel  input activation channels
 **
 ** \param [in]  inputChannel  channel depth multiplier (depthwise convolution only)
 **
 ** \param [in]  padVal  padding value
 **
 ** \param [in]  padHeight  padding Height
 **
 ** \param [in]  padWidth  padding Width
 **
 ** \param [in]  strideCol  Stride column
 **
 ** \param [in]  strideRow  Stride rows
 **
 ** \param [in]  inputOffset input offset value
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_ActivationStreamerCfg(NNLITE_Type *nnlite, cy_nnlite_context_t *context,
                                uint32_t filterWidth, uint32_t filterHeight,
                                uint32_t activationRepeats, uint32_t inputWidth,
                                uint32_t inputHeight, uint32_t inputChannel,
#if CY_IP_MXNNLITE_VERSION==1
                                uint32_t startCol, uint32_t startRow,
#endif
                                int16_t padVal, uint8_t padWidth,
                                uint8_t padHeight, uint8_t strideCol,
                                uint8_t strideRow, int32_t inputOffset);

/**
 *****************************************************************************
 ** \brief  nnlite weight streamer configuration set, API will configure offset
 ** for weight streamer and weights per neuron parameter*
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure
 **
 ** \param [in]  weightPerNeuron  weight/filter elements count per neuron
 **
 ** \param [in]  filterOffset  weight/filter elements offset value
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_WeightStreamerCfg(NNLITE_Type *nnlite, cy_nnlite_context_t *context,
                            uint32_t weightPerNeuron, int32_t filterOffset);

