PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_nnlite.h
#if CY_IP_MXNNLITE_VERSION !=1

/**
 *****************************************************************************
 ** \brief  nnlite out streamer configuration set, API will set clipping mask,
 **  offset, width, height  and channel for output streamer
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure
 **
 ** \param [in]  clipping    output clipping setting
 **
 ** \param [in]  outputOffset  output elements offset value
 **
 ** \param [in]  outputWidth  output width
 **
 ** \param [in]  outputHeight  output height
 **
 ** \param [in]  outputChannels  output Channels
 **
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_OutputStreamerCfg(NNLITE_Type *nnlite, cy_nnlite_context_t *context,
                            cy_nnlite_clipping_t clipping, int32_t outputOffset,
                            uint32_t outputWidth, uint32_t outputHeight,
                            uint32_t outputChannels);


#else

/**
 *****************************************************************************
 ** \brief  nnlite out streamer configuration set, API will set clipping mask,
 **  offset, scaling factor ,width and height for output streamer
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure
 **
 ** \param [in]  clipping    output clipping setting
 **
 ** \param [in]  outputOffset  output elements offset value
 **
 ** \param [in]  outputWidth  output width
 **
 ** \param [in]  outputHeight  output height
 **
 ** \param [in]  outputScalingFactor  output scaling factor
 **
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_OutputStreamerCfg(NNLITE_Type *nnlite, cy_nnlite_context_t *context,
                            cy_nnlite_clipping_t clipping, int32_t outputOffset,
                            uint32_t outputWidth, uint32_t outputHeight,
                            float outputScalingFactor);
/**
 *****************************************************************************
 ** \brief nnlite bias streamer enable
 **
 ** \param [in]  nnlite base pointer of register map.
 **
 ** \param [in]  biasEn bias streamer enable
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_BiasStreamerEnable(NNLITE_Type *nnlite, bool biasEn);
#endif

/**
 *****************************************************************************
 ** \brief  set nnlite streamer base address
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  strmId     streamer id
 **
 ** \param [in]  baseAddr   base address of buffer
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_StreamerBaseAddrSet(NNLITE_Type *nnlite,
                              cy_en_nnlite_streamer_id_t strmId, const void *baseAddr);


#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 ** \brief  set activation type control
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  nnLayer    NN Layer operation type
 **
 ** \param [in]  actEn      Output Activation enable
 **
 ** \param [in]  actDataSize    Activation size

 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 ** Note:  Should be set to inline as usually called with constant valued-arguments
 ** and there are is no significant checking code.
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_ActivationTypeCtrl(NNLITE_Type *nnlite,

                             cy_en_nnlite_layer_t nnLayer,
                             bool actEn,
                             cy_en_nnlite_activation_size_t actDataSize

                            );

#else


/**
 *****************************************************************************
 ** \brief Set NNLiteV2 pipeline configuration
 **
 ** \param [in] nnlite base pointer of NNLIte register map.
 ** \param [in] opType       ALU (Arithmetic accumulation) stage operation
 ** \param [in] fetchMode    Activation fetch mode (depthwise, tensorwise)
 ** \param [in] repeatWeights Enable weight repetition
 ** \param [in] biasEn         Enable bias
 ** \param [in] sparsityEn     Enable packed sparse weights
 ** \param [in] outputRescaling ALU stage scaling mode
 ** \param [in] inputRescaling   ALU prescaling  mode
 ** \param [in] actType        Activation stage activation function
 ** \param [in] inputSize      Activation.rhs input bit width
 ** \param [in] weightSize     Weight/lhs input bit width
 ** \param [in] outputSize     Output bit width.
 ** \return cy_en_nnlite_status_t
 **
 ** @note inline as typical most parameters are constants
 *****************************************************************************/
static inline cy_en_nnlite_status_t
Cy_NNLite_PipelineConfig(NNLITE_Type *nnlite,
                         cy_en_nnlite_op_t opType,
                         cy_en_nnlite_mode_t fetchMode,
                         bool repeatWeights,
                         bool biasEn,
                         bool sparsityEn,
                         cy_en_nnlite_output_rescaling_t outputRescaling,
                         cy_en_nnlite_input_rescaling_t inputRescaling,
                         cy_en_nnlite_fused_activation_t actType,
                         cy_en_nnlite_activation_size_t inputSize,
                         cy_en_nnlite_activation_size_t weightSize,
                         cy_en_nnlite_output_size_t outputSize
                        )
{
    cy_en_nnlite_status_t status;
    if ((NULL == nnlite))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->NNLAYER_CTL =
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_OPTYPE, opType) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_FETCH_MODE, fetchMode) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_REPEAT_WEIGHTS, repeatWeights) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_BIAS_EN, biasEn) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_SPARSE_EN, sparsityEn) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_SCALEFACTOR_CTL, outputRescaling) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_INPUT_RESCALE, inputRescaling) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_ACTTYPE, actType) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_INPUT_SIZE_CTL, inputSize) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_WEIGHT_SIZE_CTL, weightSize) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_OUTPUT_SIZE_CTL, outputSize) |
            _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_WPREFETCH_LEN, CY_NNLITE_PREFETCH_WORD_4x128);
        status = CY_NNLITE_SUCCESS;
    }

