PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_nnlite.h
    return status;

}

#endif

#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 ** \brief  nnlite set Interpolation lookup table to be used along
 **  with Cy_NNLite_SetinterpolationParam. For lut 0 and lut 1 both,
 **  Cy_NNLite_SetinterpolationParam need to be set.
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  lut        lookup table
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SetInterpolationLUTAddr(NNLITE_Type *nnlite, bool lut);


/**
 *****************************************************************************
 ** \brief  set interpolation parameter
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  slope      slope value for interpolation
 **
 ** \param [in]  intercept  Y-intercept value for calculation of interpolation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SetInterpolationParam(NNLITE_Type *nnlite,
                                uint16_t slope, uint16_t intercept);

#else

/**
 *****************************************************************************
 ** \brief  Set pre/post arithmetic/accumulation scaling
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  preScalingFactor Pre-scaling factor to input prior to arithmetic/accumulation operation
 **
 ** \param [in]  postScalingFactors   Post-scaling factor(s) to be applied after arithmetic/accumulation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 ** @note Scale factors are restricted IEEE754 float values.  For NNLite V2.0
 ** supported exponents [8,-24] are supported.   Mantissa is rounded to 16-bits.  Non Nan etc.
 **
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_SetPrePostScaling(NNLITE_Type *nnlite, float preScalingFactor, const float *postScalingFactors);

/**
 *****************************************************************************
 ** \brief  set interpolation parameter
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  segment    lookup segment table  addr (0: [-inf..0], 1: [0..inf] )
 **
 ** \param [in]  gradient     slope value for interpolation (IEEE 32-bit
 ** float mantissa will be rounded to 7 bits)
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SetInterpolationParam(NNLITE_Type *nnlite,
                                uint32_t segment,
                                float gradient);

/**
 *****************************************************************************
*
 * @brief Configure NNLite for Q1.15 complex FFT
 *
 * NNLite implements Decimation-in-Time  Radix-2 FFT
 *
 * @note FFT length =^= Number complex input values *2 = #
 * @param context   pointer to the driver context structure.
 * @param ppBuf0    Input / ping-pong buffer 0, Output (even stages/# values)
 * @param ppBuf1    ping-pong buffer 1, Output (odd stages/# values)
 * @param fftStages   log_2(FFT length)
 *
 * @return cy_en_nnlite_status_t
 *****************************************************************************
 */

cy_en_nnlite_status_t
Cy_NNLite_FFTCfg(NNLITE_Type *nnlite,
                 cy_nnlite_context_t *context,
                 void *ppBuf0, void *ppBuf1,
                 unsigned int fftStages);

#endif
/**
 *****************************************************************************
 ** \brief  nnlite set interrupt mask, available interrupt are operation STATUS Done,
 **   MEM Fetch Error different streamers, Output Saturation interrupt
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  intrMask    nnlite interrupt mask register
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_SetInterruptMask(NNLITE_Type *nnlite,
        uint32_t intrMask);
/**
 *****************************************************************************
 ** \brief  nnlite set datawire trigger control, trigger datawire for next layer
 **  when trigger is 1
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  trigEn  datawire trigger mask
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_DatawireTriggerEnable(NNLITE_Type *nnlite,
        bool trigEn);

/**
 *****************************************************************************
 ** \brief  nnlite get nnlite operation status, can be used to poll operation status
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [out]  opStatus    nnlite last operation status
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_GetOperationStatus(NNLITE_Type *nnlite, uint32_t *opStatus);

/**
 *****************************************************************************
 ** \brief  get nnlite interrupt status
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [out]  intrStatus    nnlite interrupt status register
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_GetInterruptStatus(NNLITE_Type *nnlite,
        uint32_t *intrStatus);

/**
 *****************************************************************************
 ** \brief  get nnlite interrupt mask
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [out] intrMask   interrupt mask value
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_GetInterruptMask(NNLITE_Type *nnlite, uint32_t *intrMask);

/**
 *****************************************************************************
 ** \brief  get nnlite driver state
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    pointer to the driver context structure
 **
 ** \param [out] nnliteState   driver current state
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_GetDriverState(NNLITE_Type *nnlite,
        cy_nnlite_context_t *context,
        cy_en_nnlite_state_t *nnliteState);

/**
 *****************************************************************************
 ** \brief  clear nnlite interrupts
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  intrMask    nnlite interrupts to be cleared
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_InterruptClear(NNLITE_Type *nnlite,
        uint32_t intrMask);

/**
 *****************************************************************************
 ** \brief  nnlite ISR handler
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    nnlite context structure pointer
 **
 *****************************************************************************/
void Cy_NNLite_InterruptHandler(NNLITE_Type *nnlite,
                                cy_nnlite_context_t *context);

/**
 *****************************************************************************
 ** \brief  wait for completion of operation in busy loop
 **
 ** \param [in]  nnlite     base pointer of NNLIte register map.
 **
 ** \param [in]  context    nnlite context structure pointer
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_WaitForCompletion(NNLITE_Type *nnlite, cy_nnlite_context_t *context);
/** \} group_nnlite_functions */
#ifdef __cplusplus
}
#endif
#endif /* CY_IP_MXNNLITE */

/** \} group_nnlite */
#endif /* CY_NNLITE_PDL_H */

/* [] END OF FILE */
